Revit 2024 API
SiteLocation.PlaceName Property
 The place name of the site.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public string PlaceName { get; set; }
Visual Basic
Public Property PlaceName As String
	Get
	Set
Visual C++
public:
property String^ PlaceName {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
SiteLocation Class
Autodesk.Revit.DB Namespace